/**
  ******************************************************************************
  * @file   awe_evtpool.h
  * @author  
  * @version V1.0
  * @date    
  * @brief   事件池的管理
  ******************************************************************************
  * @attention
  *    管理从内存中动态分配的事件
	*
  ******************************************************************************
  */
	
#ifndef   AWE_EVENT_POOL_H
#define   AWE_EVENT_POOL_H
	
#include "awe_fm.h"	
	
	




	
#endif


	
	
