/**
  ******************************************************************************
  * @file   awe_evtpool.c
  * @author  
  * @version V1.0
  * @date    
  * @brief   事件池的管理
  ******************************************************************************
  * @attention
  *    管理从内存中动态分配的事件
	*		现没用到
  ******************************************************************************
  */
	
	
#include "awe_evtpool.h"	



EVT_POOL_TYPE_  evtPool;


/**************************************************************/
/*!       事件内存池的初始化     */
void AF_poolEvt_Init(void *sto, uint32_t maxPoolEvt)
{
	
	
}






/**************************************************************/
/*!        向内存池申请一个动态事件      */
AEvt *AF_get_poolEvt_(uint32_t evtSize, ASignal sig)
{
		
		AEvt * e;
	
		return e;
}
	
	
	
	
	
/**************************************************************/
/*!        释放一个向内存池申请的动态事件      */
void AF_gc_poolEvt_(uint32_t evtSize, ASignal sig)
{
	
	
}


