/**
  ******************************************************************************
  * @file    awe_fm_port.c
  * @author  
  * @version V1.0
  * @date    
  * @brief  框架内核移植接口头文件
  ******************************************************************************
  * @attention
  *    根据对象平台不同实现不同移植实现。
	*	  	针对事件处理部分的
	*
	*
  ******************************************************************************
  */
	
#include "awe_fm_port.h"
#include "BSP_display.h"
extern	uint16_t count;		

void IdleHandle(void)
{

		uint8_t str[6]= {'0', '0', '0', '0','0'};
		//可以加入睡眠模式
		AWE_INT_UNLOCK_();                       /* 解锁操作  */	
		/* 喂狗 或者其他做的事  */
		str[4] = count % 10 + 48;
		str[3] = count / 10 % 10 + 48;
		Asc6_12(100, 100, str, 0);
}
	
	
	
	
	
	
	
	
